import random

moi= ["Абраменко", "Капкайкина", "Лукьянчикова", "Оржаховская", "Шахбалаева", "Добров", "Сажнев", "Огородникова", "Григорьева", "Ярошевская"]
ne_moi= ["Иванов", "Смирнов", "Сидоров", "Козлов", "Петров", "Яковлев", "Васильев", "Воробьев", "Федоров", "Подопригора"]
a1 = tuple(random.sample(moi, 5))
a2 = tuple(random.sample(ne_moi, 5))
a = a1+ a2
print(f"{moi}, \n {ne_moi}, \n {a}, {len(a)}")

a_sort = tuple(sorted(a))
print(a_sort)

iv = a.count("Иванов")
if iv > 0:
    print(f"Иванов встречается {iv} раз")
else:
    print("Иванов не встречается")